#define _CRT_SECURE_NO_WARNINGS 1
#include <stdio.h>

//二维数组
/*int main()
{
	//int arr[3][4] = {1,2,3,4,5};              //代表三行四列的数组。1234放在了第一行，5提到第二行了
	int arr[3][4] = { {1,2,3}, {4,5} };         //代表123放在第一行，45放在第二行
	//int arr[][] = { { 1,2,3,4 }, {5, 6, 7, 8} };            //二维数组不可以这样写,必须声明行列数

	return 0;
}*/


//二维数组的使用(行列都是从0开始递增的)
/*int main()
{
	int arr[3][4] = { {1,2,3} ,{4,5} };
	//1 2 3 0
	//4 5 0 0
	//0 0 0 0
	//遍历这个数组中的所有元素
	int i = 0;
	for (i = 0; i < 3; i++)    //行
	{
		int j = 0;
		for (j = 0; j < 4; j++)   //列
		{
			printf("%d ",arr[i][j]);
		}
		printf("\n");
	}

	return 0;
}*/



//分析二维数组在内存的存储
int main()
{
	int arr[3][4] = { {1,2,3} ,{4,5} };

	int i = 0;
	for (i = 0; i < 3; i++)  
	{
		int j = 0;
		for (j = 0; j < 4; j++) 
		{
			printf("arr[%d][%d] = %p\n",i,j,arr[i][j]);
		}
		printf("\n");
	}
	/*
	arr[0][0] = 00000001
	arr[0][1] = 00000002
	arr[0][2] = 00000003
	arr[0][3] = 00000000

	arr[1][0] = 00000004
	arr[1][1] = 00000005
	arr[1][2] = 00000000
	arr[1][3] = 00000000

	arr[2][0] = 00000000
	arr[2][1] = 00000000
	arr[2][2] = 00000000
	arr[2][3] = 00000000
	*/

	return 0;
}