package com.csu.javase.Final;
/*
1、final是java语言中的一个关键字
2、表示最终的、不可变的
3、可以修饰变量及方法、类等
4、final修饰的类无法被继承
5、final修饰的方法无法被覆盖、被重写
6、final修饰的局部变量，一旦赋值不能再重新赋值
7、final修饰的引用只能指向一个对象，且永远指向这个对象，不能再指向其他对象，但是这个对象的值可以发生改变
被指向的对象在方法执行的过程中无法被垃圾回收器回收，执行结束才会被回收
8、final修饰的实例变量必须手动赋值，不赋值会报错，可以在构造方法中赋值
9、final修饰实例变量前应该添加static关键字，变为静态的，存储在内存区
   static final修饰的变量称为常量，常量名建议全部大写，每一个单词采用下划线连接
   实际上常量和静态变量都一样，区别在于常量的值不能变
   常量和静态变量都是存储在方法区，，在类加载时初始化
   以后看见全部大写的不用猜了，全部都是常量
   常量一般都是公开的，因为它公开也不怕，也改不了，不用封装
*/
public class FinalTest01 {

}
final class A{

}
/*
B类继承A类，相当于对A类的功能进行拓展。如果不希望别人对A类型进行扩展
可以在A类中加final关键字，A类就无法被继承了
*/


/*class B extends A{

}*/
